test/.client.xml

<SOAP-ENV:Envelope 
   SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
   xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/">
 
  <SOAP-ENV:Header>

  </SOAP-ENV:Header>

  <SOAP-ENV:Body>

    <xdaq:Configure xmlns:xdaq="urn:xdaq-soap:3.0">

      <xc:Partition 
       xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  
       xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" 
       xmlns:xc="http://xdaq.web.cern.ch/xdaq/xsd/2004/XMLConfiguration-30">
	
    	 <xc:Context url="http://_host_:_port_">
	    
                <xc:Application class="_appl_" id="15" instance="0" network="local">
                  <properties xmlns="urn:xdaq-application:_appl_" xsi:type="soapenc:Struct">
                    <serverHost xsi:type="xsd:string">localhost</serverHost>
                    <serverPort xsi:type="xsd:unsignedLong">9090</serverPort>
                    <confdb xsi:type="xsd:string">null/null@null</confdb>
                    <partition xsi:type="xsd:string">null</partition>
                  </properties>
                </xc:Application>

                <xc:Module>_lib_</xc:Module>

         </xc:Context>

      </xc:Partition>
    </xdaq:Configure>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
